# include <stdio.h>

int main(void)
{
    int i = 10;
    int* p = &i;
    int** q = &p;
    int*** r = &q;

    printf("i = %d\n", *p);
    printf("i = %d\n", **q);
    printf("i = %d\n", ***r);

    printf("----------------------\n");

    printf("i的指针地址 = %d\n", &i);
    printf("p的值 = %d\n", p);
    printf("*q的值 = %d\n", *q);
    printf("**r的值 = %d\n", **r);

    printf("----------------------\n");

    printf("r的指针地址 = %d\n", &r);
    printf("r的值 = %d\n", r);

    printf("q的指针地址 = %d\n", &q);
    printf("q的值 = %d\n", q);

    printf("p的指针地址 = %d\n", &p);
    printf("p的值 = %d\n", p);

    printf("i的指针地址 = %d\n", &i);
    printf("i的值 = %d\n", i);

    printf("----------------------\n");

    printf("3级指针地址 = %d\n", &r);
    printf("3级指针的值 = %d\n", r);

    printf("2级指针地址 = %d\n", &q);
    printf("2级指针的值 = %d\n", q);

    printf("1级指针地址 = %d\n", &p);
    printf("1级指针的值 = %d\n", p);

    printf("0级指针地址 = %d\n", &i);
    printf("0级指针的值 = %d\n", i);

    return 0;
}
/* Output:
i = 10
i = 10
i = 10
----------------------
i的指针地址 = 5635288
p的值 = 5635288
*q的值 = 5635288
**r的值 = 5635288
----------------------
r的指针地址 = 5635252
r的值 = 5635264
q的指针地址 = 5635264
q的值 = 5635276
p的指针地址 = 5635276
p的值 = 5635288
i的指针地址 = 5635288
i的值 = 10
----------------------
3级指针地址 = 5635252
3级指针的值 = 5635264
2级指针地址 = 5635264
2级指针的值 = 5635276
1级指针地址 = 5635276
1级指针的值 = 5635288
0级指针地址 = 5635288
0级指针的值 = 10
*/
